package com.ravan.foodie.domain.static

import com.ravan.foodie.domain.model.SamadFood

//PLACES = {
//    "مرکزی - سلف دانشجویان آقا": "1",
//    "مرکزی - سلف دانشجویان خانم": "2",
//    "خوابگاه - طرشت 3": "3",
//    "خوابگاه - شهید احمدی روشن": "11",
//    "خوابگاه - طرشت 2 (خواهران)": "12",
//    "خوابگاه - مصلی نژاد": "10",
//    "خوابگاه - شهید وزوایی": "13",
//    "خوابگاه - شادمان": "6",
//    "خوابگاه - شهید شوریده (خواهران)": "7",
//    "خوابگاه - آزادی": "8",
//    "خوابگاه - حیدرتاش": "9",
//    "خوابگاه - ولیعصر": "14",
//    "سلف مرکزی بیرون بر": "17"
//    # "خوابگاه - درویشوند": "55",
//    # "رستوران های مکمل - سلف آزاد - دنا": "58",
//    # "رستوران های مکمل - سلف آزاد - لاله": "59"
//}
//
//PLACES_NAME_BY_ID = {
//    "1": "مرکزی - سلف دانشجویان آقا",
//    "2": "مرکزی - سلف دانشجویان خانم",
//    "3": "خوابگاه - طرشت 3",
//    "11": "خوابگاه - شهید احمدی روشن",
//    "12": "خوابگاه - طرشت 2 (خواهران)",
//    "10": "خوابگاه - مصلی نژاد",
//    "13": "خوابگاه - شهید وزوایی",
//    "6": "خوابگاه - شادمان",
//    "7": "خوابگاه - شهید شوریده (خواهران)",
//    "8": "خوابگاه - آزادی",
//    "14": "خوابگاه - ولیعصر",
//    "9": "ﺥﻭﺎﺑگﺎﻫ - ﺡیﺩﺮﺗﺎﺷ",
//    "17": "سلف مرکزی بیرون بر"
//    # "55": "خوابگاه - درویشوند",
//    # "58": "رستوران های مکمل - سلف آزاد - دنا",
//    # "59": "رستوران های مکمل - سلف آزاد - لاله"
//}
//
//UNIVERSITY_FOOD_COURT_IDS = ["1", "2"]
//
//FOOD_COURT_IDS = {
//    "سلف پسرها": 1,
//    "سلف دخترها": 2,
//    "احمدی روشن": 11,
//    "طرشت ۲": 4,
//    "طرشت ۳": 3,
//    "مصلی نژاد": 10,
//    "آزادی": 8,
//    "شهید شوریده": 7,
//    "شهید وزوایی": 13,
//    "شهید حیدرتاش": 9,
//    "شادمان": 6,
//    "ولیعصر": 14,
//    # 'شهرک': 5,
//    # 'درویش‌وند': 15
//}

val allFoods = listOf(
    SamadFood(
        name = "خوراک فیله سوخاری",
        id = 1,
    ),
    SamadFood(
        name = "چلو‌خورش قیمه‌بادمجان",
        id = 2,
    ),
    SamadFood(
        name = "لوبیا پلو",
        id = 3,
    ),
    SamadFood(
        name = "رشته پلو با گوشت",
        id = 4,
    ),
    SamadFood(
        name = "چلو خورشت مسما بادمجان",
        id = 5,
    ),
    SamadFood(
        name = "شوید پلو با مرغ",
        id = 6,
    ),
    SamadFood(
        name = "چلو با شامی کباب",
        id = 7,
    ),
    SamadFood(
        name = "چلو‌خورش بامیه",
        id = 8,
    ),
    SamadFood(
        name = "استامبولی پلو با گوشت",
        id = 9,
    ),
    SamadFood(
        name = "خوراک ماکارونی با گوشت",
        id = 10,
    ),
    SamadFood(
        name = "ساندویچ مرغ و سوپ جو",
        id = 11,
    ),
    SamadFood(
        name = "سبزی پلو با تن ماهی",
        id = 12,
    ),
    SamadFood(
        name = "چلو جوجه‌کباب",
        id = 13,
    ),
    SamadFood(
        name = "عدس‌پلو با گوشت",
        id = 14,
    ),
    SamadFood(
        name = "خوراک بندری",
        id = 15,
    ),
    SamadFood(
        name = "آش رشته و بسته میوه",
        id = 16,
    ),
    SamadFood(
        name = "زرشک پلو با گوشت",
        id = 17,
    ),
    SamadFood(
        name = "ناگت مرغ آماده (غذای سرد)",
        id = 18,
    ),
    SamadFood(
        name = "سبزی پلو با ماهی",
        id = 19,
    ),
    SamadFood(
        name = "چلو کباب کوبیده",
        id = 20,
    ),
    SamadFood(
        name = "چلو‌خورش قورمه‌سبزی",
        id = 21,
    ),
    SamadFood(
        name = "قارچ پلو",
        id = 22,
    ),
    SamadFood(
        name = "خوراک شنیتسل مرغ",
        id = 23,
    ),
    SamadFood(
        name = "چلوخورش فسنجان با مرغ",
        id = 24,
    ),
    SamadFood(
        name = "چلو‌خورش کرفس",
        id = 25,
    ),
    SamadFood(
        name = "خوراک قارچ و مرغ",
        id = 26,
    ),
    SamadFood(
        name = "خوراک کوکو سیب‌زمینی",
        id = 27,
    ),
    SamadFood(
        name = "ساندویچ کوکتل بندری نرمال",
        id = 28,
    ),
    SamadFood(
        name = "ساندویچ همبرگر ذغالی کوچک پلاس",
        id = 29,
    ),
    SamadFood(
        name = "چلو‌خورش قیمه‌ سیب زمینی",
        id = 30,
    ),
    SamadFood(
        name = "سالاد ماکارونی و سوپ جو",
        id = 31,
    ),
    SamadFood(
        name = "خوراک فلافل",
        id = 32,
    ),
    SamadFood(
        name = "خوراک عدسی و بسته میوه",
        id = 33,
    ),
    SamadFood(
        name = "ساندویچ کوکتل بندری کوچک پلاس",
        id = 34,
    ),
    SamadFood(
        name = "چلو با تن ماهی",
        id = 35,
    ),
    SamadFood(
        name = "ساندویچ کوکتل بندری کوچک اقتصادی",
        id = 36,
    ),
    SamadFood(
        name = "سالاد الویه (غذای سرد)",
        id = 37,
    ),
    SamadFood(
        name = "ساندویچ همبرگر ذغالی نرمال",
        id = 38,
    ),
    SamadFood(
        name = "ساندویچ همبرگر ذغالی کوچک اقتصادی",
        id = 39,
    ),
    SamadFood(
        name = "خوراک کتلت",
        id = 40,
    ),
    SamadFood(
        name = "چلوخورشت آلو اسفناج",
        id = 41,
    ),
    SamadFood(
        name = "کشک بادمجان",
        id = 42,
    ),
    SamadFood(
        name = "زرشک‌پلو با مرغ",
        id = 43,
    ),
    SamadFood(
        name = "الویه ژامبون نرمال",
        id = 44,
    ),
    SamadFood(
        name = "الویه ژامبون کوچک پلاس",
        id = 45,
    ),
    SamadFood(
        name = "کوکو سیب زمینی کوچک پلاس",
        id = 46,
    ),
    SamadFood(
        name = "الویه ژامبون کوچک اقتصادی",
        id = 47,
    ),
    SamadFood(
        name = "کباب مرغ با پنیرنرمال",
        id = 48,
    ),
    SamadFood(
        name = "کباب مرغ با پنیر کوچک اقتصادی",
        id = 49,
    ),
    SamadFood(
        name = "ساندویچ مرغ و خوراک لوبیا",
        id = 50,
    ),
    SamadFood(
        name = "کوکو سیب زمینی نرمال",
        id = 51,
    ),
    SamadFood(
        name = "کوکو سیب زمینی کوچک اقتصادی",
        id = 52,
    ),
    SamadFood(
        name = "کباب مرغ با پنیرکوچک پلاس",
        id = 53,
    ),
    SamadFood(
        name = "کنسرو لوبیا چیتی (غذای سرد)",
        id = 54,
    ),
    SamadFood(
        name = "کالباس خشک نرمال",
        id = 55,
    ),
    SamadFood(
        name = "ساندویچ کوکو سبزی نرمال",
        id = 56,
    ),
    SamadFood(
        name = "ساندویچ همبرگر ذغالی کوچک",
        id = 57,
    ),
    SamadFood(
        name = "ساندویچ کوکو سبزی کوچک",
        id = 58,
    ),
    SamadFood(
        name = "کالباس خشک کوچک",
        id = 59,
    ),
    SamadFood(
        name = "خوراک میرزا قاسمی",
        id = 60,
    ),
    SamadFood(
        name = "شنیتسل مرغ با برنج",
        id = 61,
    ),
    SamadFood(
        name = "ساندویچ گوشت و قارچ با پوره سیب زمینی کوچک",
        id = 62,
    ),
    SamadFood(
        name = "ساندویچ گوشت و قارچ با پوره سیب زمینی نرمال",
        id = 63,
    ),
    SamadFood(
        name = "ساندویچ مرغ و خوراک عدسی",
        id = 64,
    ),
)

//{ "name" : "خوراک فیله سوخاری", "id" : "1" }
//{ "name" : "چلو‌خورش قیمه‌بادمجان", "id" : "2" }
//{ "name" : "لوبیا پلو", "id" : "3" }
//{ "name" : "رشته پلو با گوشت", "id" : "4" }
//{ "name" : "چلو خورشت مسما بادمجان", "id" : "5" }
//{ "name" : "شوید پلو با مرغ", "id" : "6" }
//{ "name" : "چلو با شامی کباب", "id" : "7" }
//{ "name" : "چلو‌خورش بامیه", "id" : "8" }
//{ "name" : "استامبولی پلو با گوشت", "id" : "9" }
//{ "name" : "خوراک ماکارونی با گوشت", "id" : "10" }
//{ "name" : "ساندویچ مرغ و سوپ جو", "id" : "11" }
//{ "name" : "سبزی پلو با تن ماهی", "id" : "12" }
//{ "name" : "چلو جوجه‌کباب", "id" : "13" }
//{ "name" : "عدس‌پلو با گوشت", "id" : "14" }
//{ "name" : "خوراک بندری", "id" : "15" }
//{ "name" : "آش رشته و بسته میوه", "id" : "16" }
//{ "name" : "زرشک پلو با گوشت", "id" : "17" }
//{ "name" : "ناگت مرغ آماده (غذای سرد)", "id" : "18" }
//{ "name" : "سبزی پلو با ماهی", "id" : "19" }
//{ "name" : "چلو کباب کوبیده", "id" : "20" }
//{ "name" : "چلو‌خورش قورمه‌سبزی", "id" : "21" }
//{ "name" : "قارچ پلو", "id" : "22" }
//{ "name" : "خوراک شنیتسل مرغ", "id" : "23" }
//{ "name" : "چلوخورش فسنجان با مرغ", "id" : "24" }
//{ "name" : "چلو‌خورش کرفس", "id" : "25" }
//{ "name" : "خوراک قارچ و مرغ", "id" : "26" }
//{ "name" : "خوراک کوکو سیب‌زمینی", "id" : "27" }
//{ "name" : "ساندویچ کوکتل بندری نرمال", "id" : "28" }
//{ "name" : "ساندویچ همبرگر ذغالی کوچک پلاس", "id" : "29" }
//{ "name" : "چلو‌خورش قیمه‌ سیب زمینی", "id" : "30" }
//{ "name" : "سالاد ماکارونی و سوپ جو", "id" : "31" }
//{ "name" : "خوراک فلافل", "id" : "32" }
//{ "name" : "خوراک عدسی و بسته میوه", "id" : "33" }
//{ "name" : "ساندویچ کوکتل بندری کوچک پلاس", "id" : "34" }
//{ "name" : "چلو با تن ماهی", "id" : "35" }
//{ "name" : "ساندویچ کوکتل بندری کوچک اقتصادی", "id" : "36" }
//{ "name" : "سالاد الویه (غذای سرد)", "id" : "37" }
//{ "name" : "ساندویچ همبرگر ذغالی نرمال", "id" : "38" }
//{ "name" : "ساندویچ همبرگر ذغالی کوچک اقتصادی", "id" : "39" }
//{ "name" : "خوراک کتلت", "id" : "40" }
//{ "name" : "چلوخورشت آلو اسفناج", "id" : "41" }
//{ "name" : "کشک بادمجان", "id" : "42" }
//{ "name" : "زرشک‌پلو با مرغ", "id" : "43" }
//{ "name" : "الویه ژامبون نرمال", "id" : "44" }
//{ "name" : "الویه ژامبون کوچک پلاس", "id" : "45" }
//{ "name" : "کوکو سیب زمینی کوچک پلاس", "id" : "46" }
//{ "name" : "الویه ژامبون کوچک اقتصادی", "id" : "47" }
//{ "name" : "کباب مرغ با پنیرنرمال", "id" : "48" }
//{ "name" : "کباب مرغ با پنیر کوچک اقتصادی", "id" : "49" }
//{ "name" : "ساندویچ مرغ و خوراک لوبیا", "id" : "50" }
//{ "name" : "کوکو سیب زمینی نرمال", "id" : "51" }
//{ "name" : "کوکو سیب زمینی کوچک اقتصادی", "id" : "52" }
//{ "name" : "کباب مرغ با پنیرکوچک پلاس", "id" : "53" }
//{ "name" : "کنسرو لوبیا چیتی (غذای سرد)", "id" : "54" }
//{ "name" : "کالباس خشک نرمال", "id" : "55" }
//{ "name" : "ساندویچ کوکو سبزی نرمال", "id" : "56" }
//{ "name" : "ساندویچ همبرگر ذغالی کوچک", "id" : "57" }
//{ "name" : "ساندویچ کوکو سبزی کوچک", "id" : "58" }
//{ "name" : "کالباس خشک کوچک", "id" : "59" }
//{ "name" : "خوراک میرزا قاسمی", "id" : "60" }
//{ "name" : "شنیتسل مرغ با برنج", "id" : "61" }
//{ "name" : "ساندویچ گوشت و قارچ با پوره سیب زمینی کوچک", "id" : "62" }
//{ "name" : "ساندویچ گوشت و قارچ با پوره سیب زمینی نرمال", "id" : "63" }
//{ "name" : "ساندویچ مرغ و خوراک عدسی", "id" : "64" }
